---
kind: method
id: M:Autodesk.Revit.DB.ComponentRepeaterSlot.MakeDefault
source: html/1f0c0f01-6fdf-5a5c-1498-f062a2d32c25.htm
---
# Autodesk.Revit.DB.ComponentRepeaterSlot.MakeDefault Method

Populates the slot with an instance of the default family type of the component repeater.

## Syntax (C#)
```csharp
public void MakeDefault()
```